LGTM:
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.vpn must be replaced
-/+ resource "azurerm_linux_virtual_machine" "vpn" {
      ~ computer_name                   = "private-vnet-vpn" -> "private-vpn-jenkins-io" # forces replacement
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/dff2ec18-6a8e-405c-8e45-b7df7465acf0/resourceGroups/vpn/providers/Microsoft.Compute/virtualMachines/private-vnet-vpn" -> (known after apply)
        name                            = "private-vnet-vpn"
      ~ private_ip_address              = "10.248.0.5" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.248.0.5",
          - "10.248.0.4",
        ] -> (known after apply)
      ~ public_ip_address               = "172.176.126.194" -> (known after apply)
      ~ public_ip_addresses             = [
          - "172.176.126.194",
        ] -> (known after apply)
      - secure_boot_enabled             = false -> null
        tags                            = {
            "repository" = "jenkins-infra/azure-net"
            "scope"      = "terraform-managed"
        }
      ~ virtual_machine_id              = "4bc1d243-c7b3-4344-8696-50d4c6f0a60b" -> (known after apply)
      - vtpm_enabled                    = false -> null
        # (15 unchanged attributes hidden)


      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "private-vnet-vpn_OsDisk_1_418b92461a324069bf2e9e75ab7be5a0" -> (known after apply)
            # (3 unchanged attributes hidden)
        }


      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```